src/cf/DataProcessors/РаботаСРезультатамиОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РаботаСРезультатамиОбмена</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныДобавленияВРегистрОбъектыКЗагрузке</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставлениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбрабатываемойВерсии</Name>
					<Comment>Соответствует дате добавления в РС "Прочитанные данные сообщений обмена". Если отличается, то были прочитаны новые данные</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСконвертированногоОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбновленияОбъектаВИБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбновленияОбъектаПриПроблемахЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСсылкаНаОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаФорматаЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПространствоИменОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиЗапросаНаВыгрузку</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПрочитанныеДанныеСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПрочитанныеДанныеСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбъектаВИсточнике</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СодержимоеЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПространствоИменURI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛокальноеИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбрабатывающегоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КоличествоБлокируемыхОбъектовКЗагрузке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоБлокируемыхОбъектовКЗагрузке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаУстановкиПричиныДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПубличныеИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаВнешняяНавигационная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОбъектыБлокирующиеЗагрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыБлокирующиеЗагрузку</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяОбъектаФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПолученныйОбъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелПланаОбмена</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектФорматаКПолучению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/РаботаСРезультатамиОбмена/Forms/ФормаПроблемыКУстановкеСоответствия/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьДанныеФормы();
	
	ОбработатьПереданныеПараметры(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСРезультатамиОбменаКлиент.ОпределитьНеобходимостьРазворачиванияУзловОтображаемыеРеквизиты(ЭтотОбъект);
	
	ПолучитьДанныеБлокируемыеОбъекты();
	
	РаботаСРезультатамиОбменаКлиент.ПриОткрытииФормыПроблемы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.ПриСохраненииДанныхОтображаемыхРеквизитовВНастройках(ЭтотОбъект, Настройки); 
	РаботаСРезультатамиОбмена.ПриСохраненииПризнакаТолькоОтличияВФормеПроблемы(ЭтотОбъект, Настройки); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСРезультатамиОбмена.УдалитьСохраняемуюНастройкуФорму(Настройки, "ОтображаемыеРеквизиты");
	РаботаСРезультатамиОбмена.УдалитьСохраняемуюНастройкуФорму(Настройки, "ТолькоОтличия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПолученияНавигационнойСсылки(Ключ, Представление, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НавигационнаяСсылка = НавигационнаяСсылкаФормы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПереходВКомментарийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПерейтиВКомментарий" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БлокируетПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуБлокируемыеОбъекты(ЭтотОбъект, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствиеВИБСтрокаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "УстановитьСоответствие" Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, ПолноеИмяОбъектаМетаданных);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОбъектИБ" Тогда
		
		ПоказатьЗначение(, СоответствиеВИБ);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ОтменитьСоответствие" Тогда
		
		СоответствиеВИБ = Неопределено;
		СформироватьТекстСоответствия(ЭтотОбъект);
		УправлениеДоступностью(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтличияПриИзменении(Элемент)
	
	УстановитьСостояниеОтчетов(ЭтотОбъект, "ФОРМИРОВАНИЕОТЧЕТА");
	СформироватьОтчетыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РекомендацииПоРаботеПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	ОчиститьСообщения();
	
	СтандартнаяОбработка = Ложь;
	
	СсылкаСобытия = ДанныеСобытия.Href;
	
	Если СтрНайти(СсылкаСобытия, "ИзменитьНастройки") Тогда 
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуДействияПриПолученииДанныхОбмена(УзелИнформационнойБазы);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ПерейтиНаСтраницуСравнениеДанных") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиКОтчетуСравнениеДанных(СоответствиеВИБ, Элементы, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьФормуПолученныхДанных") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиКОтчетуПолученныеДанные(Элементы, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектВИсточнике") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиПоВнешнейСсылкеНаОбъект(ВнешняяСсылкаНаОбъект, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "УстановитьСоответствие") Тогда
		
		РаботаСРезультатамиОбменаКлиент.УстановитьСоответствиеВИБЕслиОтсутствует(
			ЭтотОбъект, СоответствиеВИБ, ПолноеИмяОбъектаМетаданных, "РекомендацииПоРаботе");
			
	ИначеЕсли СтрНайти(СсылкаСобытия, "ПодтвердитьЗагрузкуИОткрыть") Тогда
		
		ЗагрузитьОбъект(Истина);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ПодтвердитьЗагрузку") Тогда
		
		ЗагрузитьОбъект(Ложь);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОткрытьОбъектИБ") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьСоответствиеВИБ(СоответствиеВИБ, "РекомендацииПоРаботе");
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "ОтклонитьЗагрузку") Тогда
		
		ОтклонитьЗагрузкуОбъекта();
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "БлокируемыеОбъекты") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ОткрытьФормуБлокируемыеОбъекты(ЭтотОбъект, ПолученныйОбъект, ОбъектФормата, УзелИнформационнойБазы);
		
	ИначеЕсли СтрНайти(СсылкаСобытия, "НаписатьКомментарий") Тогда
		
		РаботаСРезультатамиОбменаКлиент.ПерейтиВКомментарий(ЭтотОбъект, УзелИнформационнойБазы, ПолученныйОбъект, ОбъектФормата, ПравилоКонвертации, Комментарий);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтображаемыеРеквизитыПолученныйОбъект

&НаКлиенте
Процедура ОтображаемыеРеквизитыПолученныйОбъектВыбранПриИзменении(Элемент)
	
	ТекущийЭлементФормы = ТекущийЭлемент;
	Если ТекущийЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ПриИзмененииВыбраноФормаТриЗначения(ЭтотОбъект, ТекущийЭлементФормы.Имя, "Выбран");
	
	УстановитьСостояниеОтчетов(ЭтотОбъект, "НЕАКТУАЛЬНОСТЬ");
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтображаемыеРеквизитыСравнениеОбъектов

&НаКлиенте
Процедура ОтображаемыеРеквизитыСравнениеОбъектовВыбранПриИзменении(Элемент)
	
	ТекущийЭлементФормы = ТекущийЭлемент;
	Если ТекущийЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиент.ПриИзмененииВыбраноФормаТриЗначения(ЭтотОбъект, ТекущийЭлементФормы.Имя, "Выбран");
	
	УстановитьСостояниеОтчетов(ЭтотОбъект, "НЕАКТУАЛЬНОСТЬ");
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьОтчеты(Команда)
	
	СформироватьОтчетыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствие(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуВыбораОбъектаДляУстановкиСоответствия(ЭтотОбъект, ПолноеИмяОбъектаМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектВИсточнике(Команда)
	
	Если ЗначениеЗаполнено(ВнешняяСсылкаНаОбъект) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ВнешняяСсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПолученныеДанные(Команда)
	
	РаботаСРезультатамиОбменаКлиент.ОткрытьФормуПолученныеДанные(ЭтотОбъект, ПолученныйОбъект, ПравилоКонвертации, ОбъектФормата, УзелИнформационнойБазы);
	
КонецПроцедуры

&НаКлиенте
Процедура Отклонить(Команда)
	
	ОтклонитьЗагрузкуОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	ЗагрузитьОбъект(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИОткрыть(Команда)
	
	ЗагрузитьОбъект(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлаги(Команда)
	
	ПриВыполненииКомандыИзменитьФлаги(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлаги(Команда)
	
	ПриВыполненииКомандыИзменитьФлаги(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

&НаСервере
Процедура ИнициализироватьДанныеФормы()
	
	РаботаСРезультатамиОбмена.ИнициализироватьДанныеФормыПроблемы(ЭтотОбъект, "РекомендацииПроблемаУстановитьСоответствие"); 
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПереданныеПараметры(Отказ)
	
	Если Параметры.ДанныеЗаписиОбъектКЗагрузке = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'В форму не передана информация о проблеме.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	РаботаСРезультатамиОбмена.ЗаполнитьРеквизитыФормыПроблемыПоПараметрам(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеФормы()

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбъектыКЗагрузке.ДатаУстановкиПричиныДобавления             КАК ДатаВозникновения,
	|	ОбъектыКЗагрузке.СсылкаНаОбъект                             КАК СсылкаНаОбъект,
	|	ОбъектыКЗагрузке.ВнешняяСсылкаНаОбъект                      КАК ВнешняяСсылкаНаОбъект,
	|	ОбъектыКЗагрузке.КомментарийАдминистратора                  КАК Комментарий,
	|	ОбъектыКЗагрузке.ПричинаДобавления                          КАК ПричинаДобавления,
	|	ПрочитанныеДанныеСообщенийОбмена.СодержимоеЗаписи           КАК СодержимоеЗаписи,
	|	ОбъектыКЗагрузке.ДатаОбрабатываемойВерсии                   КАК ДатаОбрабатываемойВерсии,
	|	ОбъектыКЗагрузке.КраткоеПредставлениеОшибки                 КАК КраткоеПредставлениеОшибки,
	|	ОбъектыКЗагрузке.ОбъектМетаданных                           КАК ОбъектМетаданных,
	|	ОбъектыКЗагрузке.ПолноеПредставлениеОшибки                  КАК ПолноеПредставлениеОшибки,
	|	ЕСТЬNULL(КоличествоБлокируемыхОбъектовКЗагрузке.Количество, 0) КАК КоличествоБлокирует
	|ИЗ
	|	РегистрСведений.ОбъектыКЗагрузке КАК ОбъектыКЗагрузке
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрочитанныеДанныеСообщенийОбмена КАК ПрочитанныеДанныеСообщенийОбмена
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = ПрочитанныеДанныеСообщенийОбмена.ПолученныйОбъект
	|			И ПрочитанныеДанныеСообщенийОбмена.УзелПланаОбмена = ОбъектыКЗагрузке.УзелПланаОбмена
	|			И ПрочитанныеДанныеСообщенийОбмена.ОбъектФормата = ОбъектыКЗагрузке.ОбъектФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоБлокируемыхОбъектовКЗагрузке КАК КоличествоБлокируемыхОбъектовКЗагрузке
	|		ПО ОбъектыКЗагрузке.ПолученныйОбъект = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектКПолучению
	|			И ОбъектыКЗагрузке.ОбъектФормата     = КоличествоБлокируемыхОбъектовКЗагрузке.ОбъектФормата
	|			И ОбъектыКЗагрузке.УзелПланаОбмена = КоличествоБлокируемыхОбъектовКЗагрузке.УзелПланаОбмена
	|ГДЕ
	|	ОбъектыКЗагрузке.ПолученныйОбъект = &ПолученныйОбъект
	|	И ОбъектыКЗагрузке.ПравилоКонвертации = &ПравилоКонвертации
	|	И ОбъектыКЗагрузке.ОбъектФормата = &ОбъектФормата
	|	И ОбъектыКЗагрузке.УзелПланаОбмена = &УзелИнформационнойБазы";
	
	Запрос.УстановитьПараметр("ПолученныйОбъект",       ПолученныйОбъект);
	Запрос.УстановитьПараметр("ОбъектФормата",          ОбъектФормата);
	Запрос.УстановитьПараметр("ПравилоКонвертации",     ПравилоКонвертации);
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ВнешняяСсылкаНаОбъект          = Выборка.ВнешняяСсылкаНаОбъект;
	ПолноеПредставлениеОшибки      = Выборка.ПолноеПредставлениеОшибки;
	ДатаОбрабатываемойВерсии       = Выборка.ДатаОбрабатываемойВерсии;
	ПричинаДобавления              = Выборка.ПричинаДобавления;
	ДатаВозникновения              = Выборка.ДатаВозникновения;
	Комментарий                    = Выборка.Комментарий;
	ИдентификаторОбъектаМетаданных = Выборка.ОбъектМетаданных;
	ПредставлениеОбъектаМетаданных = Строка(Выборка.ОбъектМетаданных);
	БлокируетНепосредственно       = Выборка.КоличествоБлокирует;
	СоответствиеВИБ                = Выборка.СсылкаНаОбъект;
	
	РаботаСРезультатамиОбмена.ЗаполнитьДанныеОбъектаМетаданныхВФормеПроблемы(ЭтотОбъект, Выборка.ОбъектМетаданных, Истина);
	
	СформироватьПредставлениеБлокирует(ЭтотОбъект);
	СформироватьТекстСоответствия(ЭтотОбъект);
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
	УправлениеДоступностью(ЭтотОбъект);
	
	ТолькоОтличия = РаботаСРезультатамиОбмена.СохраненнаяНастройкаТолькоОтличияФормыПроблемы();
	СформироватьОтчетыНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область УстановкаСоответствия

&НаКлиенте
Процедура ПослеРучногоВыбораСоответствияИБ(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Действие = "ВопросЕслиСоответствиеЕсть" Тогда
		
		УжеСопоставленныеИдентификаторы = РезультатПроверкиВыбранногоСоответствия(Результат);
		
		Если УжеСопоставленныеИдентификаторы.Количество() > 0 Тогда
			
			РаботаСРезультатамиОбменаКлиент.ОткрытьФормуСоответствиеУжеУстановлено(ЭтотОбъект,
			                                                                       Результат,
			                                                                       УжеСопоставленныеИдентификаторы,
			                                                                       ДополнительныеПараметры,
			                                                                       УзелИнформационнойБазы);
			
		Иначе
			
			ОтразитьУстановленноеСоответствие(Результат);
			
		КонецЕсли;
			
	ИначеЕсли ДополнительныеПараметры.Действие = "УстановитьСоответствие" Тогда
		
		ОтразитьУстановленноеСоответствие(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьУстановленноеСоответствие(ВыбранныйОбъект)
	
	СоответствиеВИБ                  = ВыбранныйОбъект;
	СоответствиеУстановленоВЭтойФорме = Истина;
	
	УстановитьСостояниеОтчетов(ЭтотОбъект, "ФОРМИРОВАНИЕОТЧЕТА");
	СформироватьОтчетыНаСервере();
	
	СформироватьТекстСоответствия(ЭтотОбъект);
	УправлениеДоступностью(ЭтотОбъект)
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВыбранногоСоответствия(ВыбранныйОбъект)
	
	ДанныеПроверкиПИСО = Новый Структура;
	ДанныеПроверкиПИСО.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
	ДанныеПроверкиПИСО.Вставить("Ссылка",                 ВыбранныйОбъект);
	
	Возврат РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов.ПубличныеИдентификаторыПриложенияСоответствующиеСсылке(ДанныеПроверкиПИСО);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьТекстСоответствия(Форма)
	
	ПараметрыФормирования = РаботаСРезультатамиОбменаКлиентСервер.НовыйПараметрыФормированияТекстаСоответствияВФормеПроблемы();
	ПараметрыФормирования.СоответствиеУстановленоВЭтойФорме = Форма.СоответствиеУстановленоВЭтойФорме;
	ПараметрыФормирования.ЦветГиперссылки                   = Форма.ЦветГиперссылки;
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьТекстСоответствияВФормеПроблемы(Форма, ПараметрыФормирования);
	
КонецПроцедуры

#КонецОбласти

#Область БлокируемыеОбъекты

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыеОбъекты()
	
	Если ДанныеОпосредованоПолучены
		Или БлокируетНепосредственно = 0 Тогда
		СформироватьПредставлениеБлокирует(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор);
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПолучитьДанныеБлокируемыхОбъектовЗавершение(ДлительнаяОперация, Неопределено);
		
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеБлокируемыхОбъектовЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияБлокируемыеОбъекты(УникальныйИдентификатор)
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ПолученныйОбъект", ПолученныйОбъект);
	ПараметрыПроцедуры.Вставить("ОбъектФормата",    ОбъектФормата);
	ПараметрыПроцедуры.Вставить("УзелПланаОбмена",  УзелИнформационнойБазы);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получение данных количества блокируемых объектов'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.ОбъектыБлокирующиеЗагрузку.ПолучитьКоличествоБлокируемыхОбъектов",
		                                                    ПараметрыПроцедуры, ПараметрыВыполнения);
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеБлокируемыхОбъектовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ОбработатьПолученныеДанныеБлокирует(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныеДанныеБлокирует(АдресРезультата)

	Если Не ЭтоАдресВременногоХранилища(АдресРезультата) Тогда 
		Возврат;
	КонецЕсли;
	
	ПолученныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ПолученныеДанные = Неопределено Тогда
		Возврат;
	ИначеЕсли ТипЗнч(ПолученныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	БлокируетНепосредственно = ПолученныеДанные.БлокируетНепосредственно;
	БлокируетОпосредованно   = ПолученныеДанные.БлокируетОпосредовано;
	
	ДанныеОпосредованоПолучены = Истина;
	
	СформироватьПредставлениеБлокирует(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьПредставлениеБлокирует(Форма)
	
	Если Форма.БлокируетНепосредственно = 0 Тогда
		Форма.ДанныеОпосредованоПолучены = Истина;
	КонецЕсли;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПредставлениеБлокирует(
		Форма,
		Форма.БлокируетНепосредственно,
		Форма.БлокируетОпосредованно,
		Форма.ДанныеОпосредованоПолучены);
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеЭлементамиФормы

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностью(Форма)
	
	ЭлементыФормы = Форма.Элементы;
	
	ИменаЭлементовПредставления = Новый Массив;
	ИменаЭлементовПредставления.Добавить("ОтображаемыеПоляСравнениеОбъектов");
	ИменаЭлементовПредставления.Добавить("ОтображаемыеПоляПолученныйОбъект");
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПредставлениеОтображаемыеПоля(Форма, ИменаЭлементовПредставления);
	
	Если Не ЗначениеЗаполнено(Форма.СоответствиеВИБ) Тогда
		
		ЭлементыФормы.СтраницыПолученныйОбъектСравнение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		ЭлементыФормы.СтраницыПолученныйОбъектСравнение.ТекущаяСтраница    = ЭлементыФормы.СтраницаПолученныйОбъект;
		ЭлементыФормы.ФормаПодтвердить.Заголовок                           = НСтр("ru = 'Загрузить как новый'");
		
		ЭлементыФормы.УстановитьСоответствие.Видимость = Истина;
		
	Иначе
		
		ЭлементыФормы.СтраницыПолученныйОбъектСравнение.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		ЭлементыФормы.ФормаПодтвердить.Заголовок                           = НСтр("ru = 'Подтвердить загрузку'");
		
		ЭлементыФормы.УстановитьСоответствие.Видимость = Ложь;
		
	КонецЕсли;
	
	ЭлементыФормы.ОткрытьОбъектВИсточнике.Видимость = Не ПустаяСтрока(Форма.ВнешняяСсылкаНаОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область Отчеты

&НаСервере
Процедура СформироватьОтчетыНаСервере()
	
	СформироватьОтчетПолученныеДанные();
	СформироватьОтчетСравнениеОбъектов();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетСравнениеОбъектов()
	
	ДанныеПолученногоОбъекта = Новый Структура;
	ДанныеПолученногоОбъекта.Вставить("ПолученныйОбъект",   ПолученныйОбъект);
	ДанныеПолученногоОбъекта.Вставить("ПравилоКонвертации", ПравилоКонвертации);
	ДанныеПолученногоОбъекта.Вставить("ОбъектФормата",      ОбъектФормата);
	ДанныеПолученногоОбъекта.Вставить("УзелПланаОбмена",    УзелИнформационнойБазы);
	
	РезультатФормирования = Обработки.РаботаСРезультатамиОбмена.РезультатФормированияОтчетаСравнениеОбъектов(ДанныеПолученногоОбъекта, ОтображаемыеРеквизиты, ТолькоОтличия, СоответствиеВИБ); 
	
	Если РезультатФормирования.Успешно Тогда
		
		ОтчетСравнениеОбъектов = РезультатФормирования.ТабличныйДокумент;
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетСравнениеОбъектов, "НЕИСПОЛЬЗОВАТЬ");
		
	Иначе
		
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетСравнениеОбъектов, "ОШИБКА", РезультатФормирования.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетПолученныеДанные()
	
	ДанныеПолученногоОбъекта = Новый Структура;
	ДанныеПолученногоОбъекта.Вставить("ПолученныйОбъект",   ПолученныйОбъект);
	ДанныеПолученногоОбъекта.Вставить("ПравилоКонвертации", ПравилоКонвертации);
	ДанныеПолученногоОбъекта.Вставить("ОбъектФормата",      ОбъектФормата);
	ДанныеПолученногоОбъекта.Вставить("УзелПланаОбмена",    УзелИнформационнойБазы);
	
	РезультатФормирования = Обработки.РаботаСРезультатамиОбмена.РезультатФормированияОтчетаДанныеОбъекта(ДанныеПолученногоОбъекта, ОтображаемыеРеквизиты); 
	
	Если РезультатФормирования.Успешно Тогда
		
		ОтчетПолученныйОбъект = РезультатФормирования.ТабличныйДокумент;
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетПолученныйОбъект, "НЕИСПОЛЬЗОВАТЬ")
		
	Иначе
		
		РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(
			Элементы.ОтчетПолученныйОбъект, "ОШИБКА", РезультатФормирования.ТекстОшибки);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСостояниеОтчетов(Форма, СостояниеОтчета)
	
	ЭлементыФормы = Форма.Элементы;
	
	РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭлементыФормы.ОтчетПолученныйОбъект, СостояниеОтчета);
	РаботаСРезультатамиОбменаКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭлементыФормы.ОтчетСравнениеОбъектов,СостояниеОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыполненииКомандыИзменитьФлаги(Установить)
	
	РаботаСРезультатамиОбменаКлиент.ИзменитьЗначениеФлаговВДереве(ОтображаемыеРеквизиты, Установить);
	
	УстановитьСостояниеОтчетов(ЭтотОбъект, "НЕАКТУАЛЬНОСТЬ");
	
	УправлениеДоступностью(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ИзменениеКомментария

&НаКлиенте
Процедура ПослеЗакрытияФормыКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Комментарий = Результат;
	
	РаботаСРезультатамиОбменаКлиентСервер.СформироватьПереходВКомментарий(Элементы.ПереходВКомментарийДекорация, Комментарий, ЦветГиперссылки, КартинкаКомментарий);
	
КонецПроцедуры

#КонецОбласти

#Область ОтклонениеЗагрузки

&НаСервере
Функция РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатУстановкиПричиныЗагрузкаОтклоненаВФормеПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции

&НаКлиенте
Процедура ОтклонитьЗагрузкуОбъекта()
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	
	РезультатИзмененияПричины = РезультатУстановкиПричиныЗагрузкаОтклонена(ДанныеОбъектаКОбработке);
	
	Если Не РезультатИзмененияПричины.Успешно Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатИзмененияПричины.ТекстОшибки);
		
	Иначе
		
		Оповестить("Запись_ПричинаДобавленияОбъектыКЗагрузке");
		
		Если РезультатИзмененияПричины.УстановленоСоответствие Тогда 
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.НовыйРезультатОбработкиВФормеПроблемы();
			ДанныеВозврата.ПолученныйОбъект             = ПолученныйОбъект;
			ДанныеВозврата.ПравилоКонвертации           = ПравилоКонвертации;
			ДанныеВозврата.ОбъектФормата                = ОбъектФормата;
			ДанныеВозврата.УстановленоСоответствие      = Истина;
			ДанныеВозврата.ИдентификаторФоновогоЗадания = РезультатИзмененияПричины.ИдентификаторФоновогоЗадания;
			
			Закрыть(ДанныеВозврата);
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаОбъекта

&НаКлиенте
Процедура ЗагрузитьОбъект(ОткрытьОбъектПослеЗагрузки)
	
	ОчиститьСообщения();
	
	ДанныеОбъектаКОбработке = РаботаСРезультатамиОбменаКлиент.ДанныеПроблемыКОбработкеПоДаннымФормы(ЭтотОбъект);
	
	РезультатЗагрузкиОбъекта = РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке);
	
	Если Не РезультатЗагрузкиОбъекта.Успешно Тогда
		
		Для Каждого ТекстОшибки Из РезультатЗагрузкиОбъекта.Ошибки Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		
		Возврат;
		
	Иначе
		
		НеобходимыеДействия = РаботаСРезультатамиОбменаКлиент.НеобходимыеДействияПослеЗагрузкиОбъекта(ЭтотОбъект, РезультатЗагрузкиОбъекта);
		
		Если НеобходимыеДействия.ТребуетсяВыборНовойПроблемы Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				Ложь,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			Возврат;
			
		ИначеЕсли НеобходимыеДействия.ОбъектЗагружен
			И ОткрытьОбъектПослеЗагрузки Тогда
			ТребуетсяОткрытиеОбъекта = Истина;
		Иначе
			ТребуетсяОткрытиеОбъекта = Ложь;
		КонецЕсли;
		
		Если НеобходимыеДействия.ТребуетсяОбновлениеЭтойФормы Тогда
			РаботаСРезультатамиОбменаКлиент.ПоказатьОповещениеПроблемаНеИзменилась();
			ЗаполнитьДанныеФормы();
		ИначеЕсли НеобходимыеДействия.ТребуетсяПовторноеОткрытиеФормыПроблемы
			Или ТребуетсяОткрытиеОбъекта
			Или НеобходимыеДействия.ВыполненаУстановкаСоответствия
			Или НеобходимыеДействия.ТребуетсяЗакрытиеИВыводПредупреждения Тогда
			
			ДанныеВозврата = РаботаСРезультатамиОбменаКлиент.ДанныеЗакрытияФормыПроблемыПослеЗагрузки(
				ЭтотОбъект,
				НеобходимыеДействия,
				ТребуетсяОткрытиеОбъекта,
				РезультатЗагрузкиОбъекта);
			
			Закрыть(ДанныеВозврата);
			
		Иначе
			
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция РезультатЗагрузкиОбъекта(ДанныеОбъектаКОбработке)
	
	Возврат РаботаСРезультатамиОбмена.РезультатЗагрузкиОбъектаИзФормыПроблемы(ДанныеОбъектаКОбработке);
	
КонецФункции

#КонецОбласти

#КонецОбласти
